cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'atuin'
brew 'awscli'
brew 'bash-completion'
brew 'bash'
brew 'cloudflared'
brew 'coreutils'
brew 'git'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'openssl'
brew 'postgresql@17'
brew 'redis'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'starship'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'wget'
brew 'yt-dlp'
brew 'zsh-completions'
brew 'zsh'

cask '1password'
cask 'airtable'
cask 'arc'
cask 'arq'
cask 'audacity'
cask 'cloudflare-warp'
cask 'codex'
cask 'conductor'
cask 'diffusionbee'
cask 'firefox'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-victor-mono'
cask 'garmin-express'
cask 'ghostty'
cask 'google-chrome'
cask 'google-drive'
cask 'grammarly'
cask 'handbrake-app'
cask 'iina'
cask 'iterm2'
cask 'kap'
cask 'keepingyouawake'
cask 'messenger'
cask 'microsoft-teams'
cask 'ngrok'
cask 'notion-calendar'
cask 'obsidian'
cask 'omnigraffle'
cask 'plex'
cask 'postman'
cask 'qlvideo'
cask 'raycast'
cask 'rectangle'
cask 'signal'
cask 'sonos'
cask 'spotify'
cask 'steam'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'windsurf'
cask 'zed'
cask 'zoom'
